ukw100/wordclock24h/ESP8266/ESP-WordClock/http.cpp
    hardware_configuration = get_numvar (HARDWARE_CONFIGURATION_NUM_VAR);

    SPIFFS.begin();

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H:
                fname_icon       = "wc24h-icon.txt";
                fname_weather    = "wc24h-weather.txt";
                break;
            case HW_WC_12H:
                fname_icon       = "wc12h-icon.txt";
                fname_weather    = "wc12h-weather.txt";
                break;
        }
    }

    if (fname_icon && fname_weather && SPIFFS.exists(fname_icon) && SPIFFS.exists(fname_weather))
    {
        rtc = 1;
    }

    SPIFFS.end();
    return rtc;
}

static void
message_icon_files_missing (void)
{
    if (! icon_files_exist ())
    {
        http_send_FS ("<font color=\"red\"><B>Please install the icon files onto <a href=\"spiffs\">SPIFFS</a></B></font><P>\r\n");
    }
}

static void
message_tables_file_missing (void)
{
    if (! tables_fname())
    {
        http_send_FS ("<font color=\"red\"><B>Please install the layout table file wcxx-tables-xx.txt onto <a href=\"spiffs\">SPIFFS</a></B></font><P>\r\n");
    }
}
/*-------------------------------------------------------------------------------------------------------------------------------------------
 * main page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_main (void)
{
    const char *    thispage = "";
    const char *    header_cols[MAIN_HEADER_COLS]               = { "Name", "Value" };
    const char *    datetime_header_cols[DATETIME_HEADER_COLS]  = { "YYYY", "MM", "DD", "hh", "mm", "Action" };
    const char *    ids[5]                                      = { "year", "month", "day", "hour", "min" };
    const char *    desc[5]                                     = { "", "", "", "", "" };
    int             maxlen[5]                                   = { 4, 2, 2, 2, 2 };
    int             maxsize[5]                                  = { 4, 2, 2, 2, 2 };
    char            year_str[5];
    char            mon_str[3];
    char            day_str[3];
    char            hour_str[3];
    char            minutes_str[3];
    const char *    values[5]                                   = { year_str, mon_str, day_str, hour_str, minutes_str };
    char *          action;
    const char *    message                                     = (const char *) 0;
    STR_VAR *       sv;
    const char *    esp_firmware_version                        = ESP_VERSION;
    char *          version;
    char *          eeprom_version;
    uint_fast8_t    rtc                                         = 0;
    struct tm *     tmp;
    uint_fast8_t    eeprom_is_up;
    uint_fast8_t    rtc_is_up;
    uint_fast8_t    dfplayer_is_up;
    uint_fast16_t   dfplayer_version;
    uint_fast8_t    do_reset = 0;
    uint_fast8_t    do_reset_eeprom = 0;

    sv              = get_strvar (VERSION_STR_VAR);
    version         = sv->str;

    sv              = get_strvar (EEPROM_VERSION_STR_VAR);
    eeprom_version  = sv->str;

    tmp = get_tm_var (CURRENT_TM_VAR);

    if (tmp->tm_year >= 0 && tmp->tm_mon >= 0 && tmp->tm_mday >= 0 && tmp->tm_hour >= 0 && tmp->tm_min >= 0 &&
        tmp->tm_year <= 1200 && tmp->tm_mon <= 12 && tmp->tm_mday <= 31 && tmp->tm_hour < 24 && tmp->tm_min < 60)
    {                                                               // check values to avoid buffer overflow
        sprintf (year_str,      "%4d",  tmp->tm_year + 1900);
        sprintf (mon_str,       "%02d", tmp->tm_mon + 1);
        sprintf (day_str,       "%02d", tmp->tm_mday);
        sprintf (hour_str,      "%02d", tmp->tm_hour);
        sprintf (minutes_str,   "%02d", tmp->tm_min);
    }
    else
    {
        year_str[0]     = '\0';
        mon_str[0]      = '\0';
        day_str[0]      = '\0';
        hour_str[0]     = '\0';
        minutes_str[0]  = '\0';
    }

    rtc_is_up         = get_numvar (RTC_IS_UP_NUM_VAR);
    eeprom_is_up      = get_numvar (EEPROM_IS_UP_NUM_VAR);
    dfplayer_is_up    = get_numvar (DFPLAYER_IS_UP_NUM_VAR);
    dfplayer_version  = get_numvar (DFPLAYER_VERSION_NUM_VAR);

    action = http_get_param ("action");

    if (*action)
    {
        if (! strcmp (action, "learnir"))
        {
            message = "Learning IR remote control...";
            rpc (LEARN_IR_RPC_VAR);
        }
        else if (! strcmp (action, "poweron"))
        {
            message = "Switching power on...";
            set_numvar (DISPLAY_POWER_NUM_VAR, 1);
        }
        else if (! strcmp (action, "poweroff"))
        {
            message = "Switching power off...";
            set_numvar (DISPLAY_POWER_NUM_VAR, 0);
        }
        else if (! strcmp (action, "apoweron"))
        {
            message = "Switching ambilight power on...";
            set_numvar (DISPLAY_AMBILIGHT_POWER_NUM_VAR, 1);
        }
        else if (! strcmp (action, "apoweroff"))
        {
            message = "Switching ambilight power off...";
            set_numvar (DISPLAY_AMBILIGHT_POWER_NUM_VAR, 0);
        }
        else if (! strcmp (action, "rststm32"))
        {
            message = "Resetting STM32...";
            do_reset = 1;
        }
        else if (! strcmp (action, "rsteeprom"))
        {
            do_reset_eeprom = 1;
        }
        else if (! strcmp (action, "rsteeprom2"))
        {
            message = "Resetting EEPROM, you should now restart STM32...";
            rpc (RESET_EEPROM_RPC_VAR);
            do_reset_eeprom = 2;
        }
        else if (! strcmp (action, "savedatetime"))
        {
            TM tm;

            int year    = atoi (http_get_param ("year"));
            int month   = atoi (http_get_param ("month"));
            int day     = atoi (http_get_param ("day"));
            int hour    = atoi (http_get_param ("hour"));
            int minutes = atoi (http_get_param ("min"));

            sprintf (year_str,      "%4d",  year);
            sprintf (mon_str,       "%02d", month);
            sprintf (day_str,       "%02d", day);
            sprintf (hour_str,      "%02d", hour);
            sprintf (minutes_str,   "%02d", minutes);

            tm.tm_year  = year - 1900;
            tm.tm_mon   = month - 1;
            tm.tm_mday  = day;
            tm.tm_hour  = hour;
            tm.tm_min   = minutes;
            tm.tm_sec   = 0;
            tm.tm_wday  = dayofweek (day, month, year);

            set_tm_var (CURRENT_TM_VAR, &tm);
        }
        else if (! strcmp (action, "saveticker"))
        {
            char * ticker = http_get_param ("ticker");
            set_strvar (TICKER_TEXT_STR_VAR, ticker);
        }
    }

    if (do_reset)
    {
        http_header ("WordClock Reset", "20", "/");
    }
    else
    {
        http_header ("WordClock", (const char *) NULL, (const char *) NULL);
    }

    begin_box ("WordClock");

    if (do_reset_eeprom == 1)
    {
        begin_form (thispage);
        http_send_FS ("<P><B>Are you really shure to set all EEPROM values to factory settings?</B>\r\n");
        button_field ("rsteeprom2", "YES, Reset EEPROM!");
        end_form ();
        end_box ();
        http_trailer ();
        http_flush ();
    }
    else if (do_reset_eeprom == 2)
    {
        begin_form (thispage);
        http_send_FS ("<P><B>You should now restart STM32</B><BR>\r\n");
        button_field ("rststm32", "Restart STM32");
        end_form ();
        end_box ();
        http_trailer ();
        http_flush ();
    }
    else if (do_reset)
    {
        http_send_FS ("<P><B>Resetting STM32, reconnecting in 20 seconds ...</B><BR>\r\n");
        end_box ();
        http_trailer ();
        http_flush ();
        delay (200);
        stm32_reset ();
    }
    else
    {
        message_tables_file_missing ();
    
