ukw100/wordclock24h/ESP8266/ESP-WordClock/http.cpp
#if 0
const uint_fast8_t  overlay_map[N_OVERLAY_TYPES] =
{
    OVERLAY_TYPE_NONE,
    OVERLAY_TYPE_ICON,
    OVERLAY_TYPE_DATE,
    OVERLAY_TYPE_TEMPERATURE,
    OVERLAY_TYPE_WEATHER_ICON,
    OVERLAY_TYPE_WEATHER_FC_ICON,
    OVERLAY_TYPE_WEATHER,
    OVERLAY_TYPE_WEATHER_FC,
    OVERLAY_TYPE_TICKER,
    OVERLAY_TYPE_MP3,
};
#endif

static uint_fast8_t
http_overlays (void)
{
    const char *        thispage = "overlays";
    const char *        overlay_cols[OVERLAY_HEADER_COLS] = { "Active", "Type", "Value", "Interval<BR>(min)", "Duration<BR>(sec)",
                                                              "Date<BR>Code", "or", "MM", "DD", "Days" };
    const char *        date_codes[N_DATE_CODES] = { "----", "Carnival", "Easter Sunday", "1st Advent", "2nd Advent", "3rd Advent", "4th Advent" };
    char *              action;
    const char *        message         = (const char *) 0;
    uint_fast8_t        overlay_idx;
    uint_fast8_t        n_overlays;
    char                id[8];
    char                disp[8];
    char                hidden[64];
    uint_fast8_t        idx;
    uint_fast8_t        oidx = 0xFF;
    uint_fast8_t        rtc = 0;

    action = http_get_param ("action");

    if (! *action)
    {
        action = http_get_param ("oid");       // id by autosubmit
    }

    n_overlays = get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR);

    if (action)
    {
        if (! strncmp (action, "disp", 4))
        {
            overlay_idx = atoi (action + 4);
            set_numvar (DISPLAY_OVERLAY_NUM_VAR, overlay_idx);
        }
        else if (! strncmp (action, "saveoid", 7))
        {
            oidx = atoi (action + 7);
        }
        else if (! strncmp (action, "oid", 3))
        {
            oidx = atoi (action + 3);
        }

        if (oidx != 0xff)
        {
            uint_fast8_t  val;
            uint_fast8_t  valmm;
            uint_fast8_t  valdd;

            if (oidx == n_overlays)
            {
                n_overlays++;
                set_numvar (OVERLAY_N_OVERLAYS_NUM_VAR, n_overlays);
            }

            if (http_get_checkbox_param ("oact"))
            {
                overlays[oidx].flags |= OVERLAY_FLAG_ACTIVE;
            }
            else
            {
                overlays[oidx].flags &= ~OVERLAY_FLAG_ACTIVE;
            }
            
            overlays[oidx].type = atoi (http_get_param ("otype"));
            val = atoi (http_get_param ("oint"));

            if (val == 0)
            {
                val = 5;
            }

            overlays[oidx].interval = val;

            val = atoi (http_get_param ("oduration"));

            if (val < 5)
            {
                val = 5;
            }
            else if (val > 9)
            {
                val = 9;
            }

            overlays[oidx].duration = val;

            overlays[oidx].date_code   = atoi (http_get_param ("odc"));

            valmm = atoi (http_get_param ("odstmm"));
            valdd = atoi (http_get_param ("odstdd"));

            if (valmm < 1 || valmm > 12 || valdd < 1 || valdd > 31)
            {
                overlays[oidx].date_start = 0;
            }
            else
            {
                overlays[oidx].date_start  = (valmm << 8) | valdd;
            }

            val = atoi (http_get_param ("od"));

            if (val < 1)
            {
                overlays[oidx].days = 1;
            }
            else
            {
                overlays[oidx].days = val;
            }

            if (overlays[oidx].type == OVERLAY_TYPE_MP3)
            {
                sprintf (overlays[oidx].text, "%02d/%03d", atoi (http_get_param ("ofo")), atoi (http_get_param ("otr")));
            }
            else
            {
                strncpy (overlays[oidx].text, http_get_param ("oname"), OVERLAY_MAX_TEXT_LEN);
                overlays[oidx].text[OVERLAY_MAX_TEXT_LEN] = '\0';
            }

            set_overlay_var (oidx);
        }
    }

    http_header ("WordClock Overlays", (const char *) NULL, (const char *) NULL);
    begin_box ("WordClock Overlays");
    message_icon_files_missing ();
    message_tables_file_missing ();

    n_overlays = get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR);

    if (n_overlays > 0)
    {
        table_header (overlay_cols, OVERLAY_HEADER_COLS);

        for (idx = 0; idx < n_overlays; idx++)
        {
            sprintf (disp, "%d", idx);
            sprintf (id, "oid%d", idx);
            sprintf (hidden, "<input type=\"hidden\" name=\"oid\" value=\"oid%d\">", idx);

            begin_table_row_form (thispage);

            checkbox_column ("oact", "", (overlays[idx].flags & OVERLAY_FLAG_ACTIVE) ? 1 : 0);
            select_column ("otype", overlay_types, overlays[idx].type, N_OVERLAY_TYPES, 1);

            if (overlays[idx].type == OVERLAY_TYPE_ICON)
            {
                begin_column ();
                select_icons ("oname", overlays[idx].text);
                end_column ();
            }
            else if (overlays[idx].type == OVERLAY_TYPE_TICKER)
            {
                input_column ("oname", "", overlays[idx].text, OVERLAY_MAX_TEXT_LEN, OVERLAY_MAX_TEXT_LEN / 2);
            }
            else if (overlays[idx].type == OVERLAY_TYPE_MP3)
            {
                char    folderbuf[8];
                char    trackbuf[8];
                char *  p;

                p = strchr (overlays[idx].text, '/');

                if (p)
                {
                    int   folder;
                    int   track;

                    folder = atoi (overlays[idx].text);
                    track  = atoi (p + 1);
                    sprintf (folderbuf, "%02d", folder);
                    sprintf (trackbuf, "%03d", track);
                }
                else
                {
                    folderbuf[0] = '\0';
                    trackbuf[0] = '\0';
                }

                begin_column ();
                input_field ("ofo", "F", folderbuf, OVERLAY_MAX_FOLDER_LEN, OVERLAY_MAX_FOLDER_LEN);
                input_field ("otr", "T",  trackbuf, OVERLAY_MAX_TRACK_LEN,  OVERLAY_MAX_TRACK_LEN);
                end_column ();
            }
            else
            {
                text_column ("");
            }

            input_column ("oint",  "", overlays[idx].interval, 2, 2);

            if (overlays[idx].type == OVERLAY_TYPE_ICON || overlays[idx].type == OVERLAY_TYPE_WEATHER_ICON || overlays[idx].type == OVERLAY_TYPE_WEATHER_FC_ICON)
            {
                input_column ("oduration",  "", overlays[idx].duration, 1, 1);
            }
            else
            {
                 text_column ("");
            }

            select_column ("odc", date_codes, overlays[idx].date_code, N_DATE_CODES, 1);

            text_column (hidden);     // "or"

