ukw100/wordclock24h/ESP8266/ESP-WordClock/http.cpp
    table_trailer ();
    begin_form (thispage);
    end_form ();

    if (message)
    {
        http_send_FS ("<P><font color=green>");
        http_send (message);
        http_send_FS ("</font>\r\n");
    }

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

static void
table_row_timers (const char * page, uint_fast8_t is_ambilight, int idx)
{
    char            id[8];
    char            idx_buf[3];
    char            hour_buf[3];
    char            minute_buf[3];
    char            act_id[8];
    char            on_id[8];
    char            hour_id[8];
    char            min_id[8];
    char            day_id[8];
    NIGHT_TIME *    nt;

    nt = get_night_time_var (is_ambilight, (NIGHT_TIME_VARIABLE) idx);

    if (nt)
    {
        sprintf (hour_buf,   "%02d", nt->minutes / 60);
        sprintf (minute_buf, "%02d", nt->minutes % 60);

        begin_table_row_form (page);

        sprintf (idx_buf, "%d",   idx);
        sprintf (id,      "id%d", idx);
        sprintf (act_id,  "a%d",  idx);
        sprintf (on_id,   "o%d",  idx);
        sprintf (hour_id, "h%d",  idx);
        sprintf (min_id,  "m%d",  idx);

        text_column (idx_buf);

        checkbox_column (act_id, "", (nt->flags & NIGHT_TIME_FLAG_ACTIVE) ? 1 : 0);
        checkbox_column (on_id, "", (nt->flags & NIGHT_TIME_FLAG_SWITCH_ON) ? 1 : 0);

        sprintf (day_id, "f%d", idx);
        select_column (day_id, wdays_en, (nt->flags & NIGHT_TIME_FROM_DAY_MASK) >> 3, 7, 0);

        sprintf (day_id, "t%d", idx);
        select_column (day_id, wdays_en, (nt->flags & NIGHT_TIME_TO_DAY_MASK), 7, 0);

        input_column (hour_id, "",  hour_buf, 2, 2);
        input_column (min_id, "",  minute_buf, 2, 2);

        save_column (id);
        end_table_row_form ();
    }
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * timers page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_timers (uint_fast8_t is_ambilight)
{
    const char *        header_cols[TIMERS_HEADER_COLS] = { "Slot", "Active", "On", "From", "To", "Hour", "Min", "Action" };
    const char *        thispage;
    char *              action;
    const char *        title;
    uint_fast8_t        idx;
    uint_fast8_t        rtc = 0;

    action = http_get_param ("action");

    if (action)
    {
        if (! strncmp (action, "saveid", 6))
        {
            char id[16];
            uint_fast8_t idx = atoi (action + 6);

            if (idx < MAX_NIGHT_TIME_VARIABLES)
            {
                NIGHT_TIME *    nt;
                uint_fast8_t    from_day;
                uint_fast8_t    to_day;
                uint_fast16_t   minutes;
                uint_fast8_t    flags;

                nt = get_night_time_var (is_ambilight, (NIGHT_TIME_VARIABLE) idx);

                flags = nt->flags;

                if (http_get_checkbox_param_by_idx ("a", idx))
                {
                    flags |= NIGHT_TIME_FLAG_ACTIVE;
                }
                else
                {
                    flags &= ~NIGHT_TIME_FLAG_ACTIVE;
                }

                if (http_get_checkbox_param_by_idx ("o", idx))
                {
                    flags |= NIGHT_TIME_FLAG_SWITCH_ON;
                }
                else
                {
                    flags &= ~NIGHT_TIME_FLAG_SWITCH_ON;
                }

                sprintf (id, "f%d", idx);
                from_day = atoi (http_get_param (id));
                sprintf (id, "t%d", idx);
                to_day = atoi (http_get_param (id));

                flags &= ~(NIGHT_TIME_FROM_DAY_MASK | NIGHT_TIME_TO_DAY_MASK);
                flags |= NIGHT_TIME_FROM_DAY_MASK & (from_day << 3);
                flags |= NIGHT_TIME_TO_DAY_MASK & (to_day);

                minutes = atoi (http_get_param_by_idx ("h", idx)) * 60 + atoi (http_get_param_by_idx ("m", idx));

                set_night_time_var (is_ambilight, (NIGHT_TIME_VARIABLE) idx, minutes, flags);
            }
        }
    }

    if (is_ambilight)
    {
        title = "WordClock Ambilight Timers";
        thispage = "atimers";
    }
    else
    {
        title = "WordClock Timers";
        thispage = "timers";
    }

    http_header (title, (const char *) NULL, (const char *) NULL);
    begin_box (title);

    table_header (header_cols, TIMERS_HEADER_COLS);

    for (idx = 0; idx < MAX_NIGHT_TIME_VARIABLES; idx++)
    {
        table_row_timers (thispage, is_ambilight, idx);
    }

    table_trailer ();

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

static void
table_row_alarm_timers (const char * page, int idx)
{
    char            id[8];
    char            idx_buf[8];
    char            hour_buf[3];
    char            minute_buf[3];
    char            act_id[8];
    char            on_id[8];
    char            hour_id[8];
    char            min_id[8];
    char            day_id[8];
    ALARM_TIME *    at;

    at = get_alarm_time_var ((ALARM_TIME_VARIABLE) idx);

    if (at)
    {
        sprintf (hour_buf,   "%02d", at->minutes / 60);
        sprintf (minute_buf, "%02d", at->minutes % 60);

        begin_table_row_form (page);

        sprintf (idx_buf, "%03d.mp3", idx + 1);                             // 001.mp3 ... 008.mp3
        sprintf (id,      "id%d",     idx);
        sprintf (act_id,  "a%d",      idx);
        sprintf (on_id,   "o%d",      idx);
        sprintf (hour_id, "h%d",      idx);
        sprintf (min_id,  "m%d",      idx);

        text_column (idx_buf);

        checkbox_column (act_id, "", (at->flags & ALARM_TIME_FLAG_ACTIVE) ? 1 : 0);

        sprintf (day_id, "f%d", idx);
        select_column (day_id, wdays_en, (at->flags & ALARM_TIME_FROM_DAY_MASK) >> 3, 7, 0);

        sprintf (day_id, "t%d", idx);
        select_column (day_id, wdays_en, (at->flags & ALARM_TIME_TO_DAY_MASK), 7, 0);

        input_column (hour_id, "",  hour_buf, 2, 2);
        input_column (min_id, "",  minute_buf, 2, 2);

        save_column (id);
        end_table_row_form ();
    }
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * dfplayer page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define PLAY_TRACK_HEADER_COLS  3
#define DFPLAYER_MAX_VOLUME     30
#define MAX_SILENCE_START_LEN   4
#define MAX_SILENCE_STOP_LEN    4

static uint_fast8_t
http_dfplayer (void)
{
    const char *    thispage = "dfplayer";
    const char *    dfplayer_header_cols[DFPLAYER_HEADER_COLS]      = { "Name", "Value", "Action" };
    const char *    dfplayer_silence_cols[DFPLAYER_SILENCE_COLS]    =  { "Name", "Hour", "Min", "Action" };
    const char *    alarm_header_cols[ALARM_TIMERS_HEADER_COLS]     = { "Track", "Active", "From", "To", "Hour", "Min", "Action" };
    const char *    play_track_header_cols[PLAY_TRACK_HEADER_COLS]  = { "Folder", "Track", "Action" };
    const char *    dfplayer_mode_names[3]                          = { "None", "Bell", "Speak" };
    uint_fast8_t    max_dfplayer_modes = 3;
    char            txtbuf[32];
    char            hour_buf[3];
    char            minute_buf[3];
    char            valbuf[32];
    char            maxbuf[32];
    uint_fast8_t    idx;
    uint_fast8_t    volume;
    uint_fast16_t   silence_start;
    uint_fast16_t   silence_stop;
    uint_fast8_t    dfplayer_mode;
    uint_fast8_t    bell_flags;
    uint_fast8_t    speak_cycle;
    uint_fast8_t    folder;
    uint_fast8_t    track;
    char *          action;
    uint_fast8_t    rtc = 0;

    action = http_get_param ("action");

    if (action)
    {
        if (! strcmp (action, "savevolume"))
        {
            volume = atoi (http_get_param (action + 4));

            if (volume > DFPLAYER_MAX_VOLUME)
            {
                volume = DFPLAYER_MAX_VOLUME;
            }

