ukw100/wordclock24h/ESP8266/ESP-WordClock/http.cpp
            set_numvar (DFPLAYER_VOLUME_NUM_VAR, volume);
        }
        else if (! strcmp (action, "savesilstart"))
        {
            uint_fast16_t   silstarth;
            uint_fast16_t   silstartm;

            silstarth = atoi (http_get_param ("silstarth"));
            silstartm = atoi (http_get_param ("silstartm"));

            if (silstarth < 24 && silstartm < 60)
            {
                silence_start = 60 * silstarth + silstartm;
                set_numvar (DFPLAYER_SILENCE_START_NUM_VAR, silence_start);
            }
        }
        else if (! strcmp (action, "savesilstop"))
        {
            uint_fast16_t   silstoph;
            uint_fast16_t   silstopm;

            silstoph = atoi (http_get_param ("silstoph"));
            silstopm = atoi (http_get_param ("silstopm"));

            if (silstoph < 24 && silstopm < 60)
            {
                silence_stop = 60 * silstoph + silstopm;
                set_numvar (DFPLAYER_SILENCE_STOP_NUM_VAR, silence_stop);
            }
        }
        else if (! strcmp (action, "savemode"))
        {
            dfplayer_mode = atoi (http_get_param (action + 4));
            set_numvar (DFPLAYER_MODE_NUM_VAR, dfplayer_mode);
        }
        else if (! strcmp (action, "savebell"))
        {
            bell_flags = DFPLAYER_MODE_BELL_FLAG_NONE;

            if (http_get_checkbox_param ("m15"))
            {
                bell_flags |= DFPLAYER_MODE_BELL_FLAG_15;
            }
            if (http_get_checkbox_param ("m30"))
            {
                bell_flags |= DFPLAYER_MODE_BELL_FLAG_30;
            }
            if (http_get_checkbox_param ("m45"))
            {
                bell_flags |= DFPLAYER_MODE_BELL_FLAG_45;
            }

            set_numvar (DFPLAYER_BELL_FLAGS_NUM_VAR, bell_flags);
        }
        else if (! strcmp (action, "savespeak"))
        {
            speak_cycle = atoi (http_get_param (action + 4));
            set_numvar (DFPLAYER_SPEAK_CYCLE_NUM_VAR, speak_cycle);
        }
        else if (! strncmp (action, "saveid", 6))
        {
            char id[16];

            idx = atoi (action + 6);

            if (idx < MAX_ALARM_TIME_VARIABLES)
            {
                ALARM_TIME *    at;
                uint_fast8_t    from_day;
                uint_fast8_t    to_day;
                uint_fast16_t   minutes;
                uint_fast8_t    flags;

                at = get_alarm_time_var ((ALARM_TIME_VARIABLE) idx);

                flags = at->flags;

                if (http_get_checkbox_param_by_idx ("a", idx))
                {
                    flags |= ALARM_TIME_FLAG_ACTIVE;
                }
                else
                {
                    flags &= ~ALARM_TIME_FLAG_ACTIVE;
                }

                sprintf (id, "f%d", idx);
                from_day = atoi (http_get_param (id));
                sprintf (id, "t%d", idx);
                to_day = atoi (http_get_param (id));

                flags &= ~(ALARM_TIME_FROM_DAY_MASK | ALARM_TIME_TO_DAY_MASK);
                flags |= ALARM_TIME_FROM_DAY_MASK & (from_day << 3);
                flags |= ALARM_TIME_TO_DAY_MASK & (to_day);

                minutes = atoi (http_get_param_by_idx ("h", idx)) * 60 + atoi (http_get_param_by_idx ("m", idx));

                set_alarm_time_var ((ALARM_TIME_VARIABLE) idx, minutes, flags);
            }
        }
        else if (! strcmp (action, "play"))
        {
            folder = atoi (http_get_param ("plfolder"));
            track  = atoi (http_get_param ("pltrack"));
            set_numvar (DFPLAYER_PLAY_FOLDER_TRACK_NUM_VAR, folder << 8 | track);
        }
    }

    http_header ("WordClock DFPlayer", (const char *) NULL, (const char *) NULL);
    begin_box ("WordClock DFPlayer");

    volume        = get_numvar (DFPLAYER_VOLUME_NUM_VAR);
    silence_start = get_numvar (DFPLAYER_SILENCE_START_NUM_VAR);
    silence_stop  = get_numvar (DFPLAYER_SILENCE_STOP_NUM_VAR);
    dfplayer_mode = get_numvar (DFPLAYER_MODE_NUM_VAR);
    bell_flags    = get_numvar (DFPLAYER_BELL_FLAGS_NUM_VAR);
    speak_cycle   = get_numvar (DFPLAYER_SPEAK_CYCLE_NUM_VAR);

    table_header (dfplayer_header_cols, DFPLAYER_HEADER_COLS);

    sprintf (txtbuf, "Volume (0-%d)", DFPLAYER_MAX_VOLUME);
    sprintf (valbuf, "%d", volume);
    sprintf (maxbuf, "%d", DFPLAYER_MAX_VOLUME);
    table_row_slider (thispage, txtbuf, "volume", valbuf, "0", maxbuf);
    table_row_select (thispage, "Mode", "mode", dfplayer_mode_names, dfplayer_mode, max_dfplayer_modes, 0);

    switch (dfplayer_mode)
    {
        case DFPLAYER_MODE_BELL:
        {
            begin_table_row_form (thispage);
            text_column ("Bell");
            http_send_FS ("<td>");
            checkbox_field ("m15", "xx:15", (bell_flags & DFPLAYER_MODE_BELL_FLAG_15) ? 1 : 0);
            checkbox_field ("m30", "xx:30", (bell_flags & DFPLAYER_MODE_BELL_FLAG_30) ? 1 : 0);
            checkbox_field ("m45", "xx:45", (bell_flags & DFPLAYER_MODE_BELL_FLAG_45) ? 1 : 0);
            http_send_FS ("</td>");
            save_column ("bell");
            end_table_row_form ();
            break;
        }
        case DFPLAYER_MODE_SPEAK:
        {
            table_row_input (thispage, 3, "Speak cycle", "speak", speak_cycle, 3);
            break;
        }
    }

    table_trailer ();

    table_header (dfplayer_silence_cols, DFPLAYER_SILENCE_COLS);

    begin_table_row_form (thispage);
    text_column ("Silence start");
    sprintf (hour_buf,   "%02d", silence_start / 60);
    sprintf (minute_buf, "%02d", silence_start % 60);
    input_column ("silstarth", "",  hour_buf, 2, 2);
    input_column ("silstartm", "",  minute_buf, 2, 2);
    save_column ("silstart");
    end_table_row_form ();

    begin_table_row_form (thispage);
    text_column ("Silence stop");
    sprintf (hour_buf,   "%02d", silence_stop / 60);
    sprintf (minute_buf, "%02d", silence_stop % 60);
    input_column ("silstoph", "",  hour_buf, 2, 2);
    input_column ("silstopm", "",  minute_buf, 2, 2);
    save_column ("silstop");
    end_table_row_form ();

