ukw100/wordclock24h/ESP8266/ESP-WordClock/http.cpp
    table_trailer ();

    table_header (alarm_header_cols, ALARM_TIMERS_HEADER_COLS);

    for (idx = 0; idx < MAX_ALARM_TIME_VARIABLES; idx++)
    {
        table_row_alarm_timers (thispage, idx);
    }

    table_trailer ();

    table_header (play_track_header_cols, PLAY_TRACK_HEADER_COLS);

    begin_table_row_form (thispage, 0);
    input_column ("plfolder", "",  "", 2, 2);
    input_column ("pltrack",  "",  "", 3, 3);
    button_column ("play", "Play");
    end_table_row_form ();

    table_trailer ();

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

bool
download_file (const char * host, const char * path, const char * filename)
{
    unsigned char   buf[1024];
    int             len;                                                // content len
    bool            rtc = false;

    len = httpclient (host, path, filename);

    if (len > 0)
    {
        int ch;
        int idx = 0;

        File f = SPIFFS.open(filename, "w");

        while (len > 0)
        {
            ch = httpclient_read (&len);
            buf[idx++] = ch;
            if (idx == 1024)
            {
               f.write (buf, idx);
               idx = 0;
            }
        }

        if (idx > 0)
        {
           f.write (buf, idx);
        }

        f.close ();
        httpclient_stop ();
        rtc = true;
    }
    return rtc;
}

static bool
read_line (String& line)
{
    int c;
    ulong start_millis = 0;
    ulong ellapsed_millis = 0;

    line = "";

    do
    {
        start_millis = millis();
        c = http_client.read();
        ellapsed_millis = (millis() - start_millis);

        if (c >= 0 && c != '\n' && c != '\r')
        {
            line += (char) c;
        }
    } while (c >= 0 && c != '\r' && (ellapsed_millis < 1000));

    yield();
    return (c >= 0) && (ellapsed_millis < 1000);
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * spiffs page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define FSINFO_HEADER_COLS      2
#define DIRECTORY_HEADER_COLS   2

#define POST_ICON_NONE            0
#define POST_ICON_FILE            1
#define POST_ICON_WEATHER_FILE    2
#define POST_TABLES_FILE          3

static uint_fast8_t
http_spiffs (int post = POST_ICON_NONE)
{
    const char *    thispage = "spiffs";
    const char *    update_header_cols[UPDATE_HEADER_COLS]  = { "Name", "Value" };
    const char *    fsinfo_cols[FSINFO_HEADER_COLS]         = { "Parameter", "Value" };
    const char *    directory_cols[DIRECTORY_HEADER_COLS]   = { "File", "Size" };
    char *          action;
    char            valbuf[16];
    const char *    fname_icon = (const char *) 0;
    const char *    fname_weather  = (const char *) 0;
    const char *    fname_tables  = (const char *) 0;
    const char *    show_fname = (const char *) 0;
    char *          update_host;
    char *          update_path;
    FSInfo          fsinfo;
    uint_fast16_t   hardware_configuration;
    int             download_rtc = 2;
    STR_VAR *       sv;
    const char *    tables_filter = NULL;
    int             len;
    uint_fast8_t    rtc = 0;

    action = http_get_param ("action");

    hardware_configuration = get_numvar (HARDWARE_CONFIGURATION_NUM_VAR);

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H:
                fname_icon      = "wc24h-icon.txt";
                fname_weather   = "wc24h-weather.txt";
                fname_tables    = "wc24h-tables-local.txt";
                tables_filter   = "wc24h-tables-"; break;
                break;
            case HW_WC_12H:
                fname_icon      = "wc12h-icon.txt";
                fname_weather   = "wc12h-weather.txt";
                fname_tables    = "wc12h-tables-local.txt";
                tables_filter   = "wc12h-tables-";
                break;
        }
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        set_strvar (UPDATE_HOST_VAR, DEFAULT_UPDATE_HOST);
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        set_strvar (UPDATE_PATH_VAR, DEFAULT_UPDATE_PATH);
    }

    if (post != POST_ICON_NONE)
    {
        File f = (File) 0;
        String line;
        SPIFFS.begin();

        if (post == POST_ICON_FILE)
        {
            if (fname_icon)
            {
                f = SPIFFS.open(fname_icon, "w+");
            }
        }
        else if (post == POST_ICON_WEATHER_FILE)
        {
            if (fname_weather)
            {
                f = SPIFFS.open(fname_weather, "w+");
            }
        }
        else if (post == POST_TABLES_FILE)
        {
            if (fname_tables)
            {
                f = SPIFFS.open(fname_tables, "w+");
            }
        }

        if (f)
        {
            // find the line with content type and boundary string
            String boundary;

            while (read_line(line))
            {
                if (line.startsWith("Content-Type:"))
                {
                    int n = line.indexOf("boundary=");
                    if (n > 0)
                    {
                        boundary = "--" + line.substring(n + strlen("boundary="));
                    }
                    break;
                }
            }

            // no boundary? something is wrong
            if (boundary == "")
            {
                http_send("<font color='red'>Wrong http header</font><br/>");
            }
            else
            {
                // read until a boundary has been found
                while (read_line(line) && line != boundary)
                {
                    ;
                }

                // read the empty line
                while (read_line(line) && line != "")
                {
                    ;
                }

                // read and save file content until the boundary has been found
                while (read_line(line))
                {
                    // boundary found, end of file
                    if (line == boundary)
                    {
                        break;
                    }
                    f.write((const unsigned char*)line.c_str(), line.length());
                    f.write('\r');
                    f.write('\n');
                }
            }

            f.close();
        }
        else
        {
            http_send_FS ("<font color=red>Failed to upload file.</font></B><BR>\r\n");
        }

        SPIFFS.end();
    }

    if (action)
    {
        if (! strcmp (action, "format"))
        {
            SPIFFS.begin ();
            SPIFFS.format ();
            SPIFFS.end ();
        }
        else if (! strcmp (action, "saveuphost"))
        {
            set_strvar (UPDATE_HOST_VAR, http_get_param ("uphost"));
        }
        else if (! strcmp (action, "saveuppath"))
        {
            set_strvar (UPDATE_PATH_VAR, http_get_param ("uppath"));
        }
        else if (! strcmp (action, "savedwnfil"))
        {
            char * fname = http_get_param ("dwnfil");

            SPIFFS.begin ();
            download_rtc = download_file (update_host, update_path, fname);
            SPIFFS.end ();
        }
        else if (! strcmp (action, "dwntable"))
        {
            char * fname = http_get_param ("tablefile");

            SPIFFS.begin ();
            download_rtc = download_file (update_host, update_path, fname);
            SPIFFS.end ();
            tables_init ();                                                         // reload layout tables
        }
        else if (! strcmp (action, "download"))
        {
            SPIFFS.begin ();

            if (fname_icon)
            {
                download_rtc = download_file (update_host, update_path, fname_icon);
            }

