ukw100/wordclock24h/ESP8266/ESP-WordClock/http.cpp
            if (fname_weather)
            {
                download_rtc = download_file (update_host, update_path, fname_weather);
            }

            SPIFFS.end ();
        }
        else if (! strcmp (action, "remove"))
        {
            char * fname = http_get_param ("filename");
            SPIFFS.begin ();
            SPIFFS.remove (fname);
            SPIFFS.end ();
        }
        else if (! strcmp (action, "show"))
        {
            show_fname = http_get_param ("filename");
        }
    }

    http_header ("WordClock ESP8266 SPIFFS", (const char *) NULL, (const char *) NULL);
    begin_box ("WordClock ESP8266 SPIFFS");
    message_tables_file_missing ();

    if (tables_corrupt)
    {
        http_send_FS ("<font color=\"red\"><B>table file wcxx-tables-xx.txt is corrupt. Remove it, load it again or format SPIFFS!</B></font><P>\r\n");
    }

    if (download_rtc == 0)
    {
        http_send_FS ("download failed<BR>");
    }
    else if (download_rtc == 1)
    {
        http_send_FS ("download successful<BR>");
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;
    sv = get_strvar (UPDATE_PATH_VAR);
    SPIFFS.begin();

    table_header (fsinfo_cols, FSINFO_HEADER_COLS);

    if (SPIFFS.info(fsinfo))
    {
        begin_table_row ();
        text_column ("Total bytes");
        sprintf (valbuf, "%d", fsinfo.totalBytes);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Used bytes");
        sprintf (valbuf, "%d", fsinfo.usedBytes);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Block size");
        sprintf (valbuf, "%d", fsinfo.blockSize);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Page size");
        sprintf (valbuf, "%d", fsinfo.pageSize);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Max open files");
        sprintf (valbuf, "%d", fsinfo.maxOpenFiles);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Max path length");
        sprintf (valbuf, "%d", fsinfo.maxPathLength);
        text_rcolumn (valbuf);
        end_table_row ();
    }

    table_trailer ();

    Dir dir = SPIFFS.openDir("");
  
    table_header (directory_cols, DIRECTORY_HEADER_COLS);
  
    while (dir.next())
    {
        begin_table_row_form (thispage);

        begin_column ();
        http_send_FS ("<input type=\"text\" name=\"filename\" value=\"");
        http_send (dir.fileName());
        http_send_FS ("\" readonly>");
        end_column ();

        File f = dir.openFile ("r");
  
        if (f)
        {
            sprintf (valbuf, "%d", f.size());
            f.close ();
        }
        else
        {
            strcpy (valbuf, "unknown");
        }
  
        text_rcolumn (valbuf);
        button_column ("remove", "Remove");
        button_column ("show", "Show");
        end_table_row_form ();
    }

    table_trailer ();

    SPIFFS.end ();
  
    http_send_FS ("<form method=\"GET\" action=\"/spiffs\">\r\n"
                  "<button type=\"submit\" name=\"action\" value=\"format\">Format ESP8266 SPIFFS</button>"
                  "</form>");

    table_header (update_header_cols, UPDATE_HEADER_COLS);
    table_row_input (thispage, 3, "Update Host", "uphost", update_host, MAX_UPDATE_HOST_LEN);
    table_row_input (thispage, 3, "Update Path", "uppath", update_path, MAX_UPDATE_PATH_LEN);
#if 0
#define MAX_DOWNLOAD_FILENAME 32
    table_row_input (thispage, 3, "Download file", "dwnfil", "", MAX_DOWNLOAD_FILENAME);
#endif
    table_trailer ();

    http_send_FS ("<form method=\"GET\" action=\"/spiffs\">\r\n"
                  "    <button type=\"submit\" name=\"action\" value=\"download\">Download Icon files</button>\r\n"
                  "</form>\r\n");

    http_send_FS ("<form method=\"GET\" action=\"/spiffs\">"
                  "<select id=\"tablefile\" name=\"tablefile\">");

    len = httpclient (update_host, update_path, WC_TABLES_LIST_TXT);

    if (len > 0)
    {
        char         fname[MAX_UPDATE_FILENAME_LEN];
        int          ch;
        int          l = 0;

        while (len > 0)
        {
            ch = httpclient_read (&len);

            if (ch != '\r' && ch != '\n' && ch != ' ' && ch != '\t' && l < MAX_UPDATE_FILENAME_LEN - 1)
            {
                fname[l++] = ch;
            }
            else if (ch == '\n')
            {
                int show_option;

                fname[l] = '\0';
                l = 0;

                show_option = 1;

                if (tables_filter)
                {
                    if (strncmp (fname, tables_filter, strlen (tables_filter)) != 0)
                    {
                        show_option = 0;
                    }
                }

                if (show_option)
                {
                    char * p = tables_fname ();
                    http_send_FS ("<option value=\"");
                    http_send (fname);

                    if (p && ! strcmp (fname, p))
                    {
                        http_send_FS ("\" selected>");
                    }
                    else
                    {
                        http_send_FS ("\">");
                    }
                    http_send (fname);
                    http_send_FS ("</option>\r\n");
                }
            }
        }

        httpclient_stop ();
        http_flush ();
    }
    else
    {
       Serial.print("Error in HTTP request: ");
       Serial.println(WC_LIST_TXT);
    }
    http_send_FS ("</select>\r\n");

    http_send_FS ("<button type=\"submit\" name=\"action\" value=\"dwntable\">Download layout table</button>"
                  "</form>"
                  "<P>\r\n");

    http_send_FS ("<table>");

    if (fname_icon)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_icon);
        http_send_FS ("</td><td>"
                "<form method='post' action='spiffs-icon' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<input type='file' name='fileField'>"
                "</td><td><input type='submit' name='submit' value='Upload'></td>"
                "</form></tr>"
                );
    }

