ukw100/wordclock24h/ESP8266/ESP-WordClock/http.cpp
    if (fname_weather)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_weather);
        http_send_FS ("</td><td>"
                "<form method='post' action='spiffs-icon-weather' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<input type='file' name='fileField'>"
                "</td><td><input type='submit' name='submit' value='Upload'></td>"
                "</form></tr>"
                );
    }

    if (fname_weather)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_tables);
        http_send_FS ("</td><td>"
                "<form method='post' action='spiffs-tables' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<input type='file' name='fileField'>"
                "</td><td><input type='submit' name='submit' value='Upload'></td>"
                "</form></tr>"
                );
    }

    http_send_FS ("</table>");

    if (show_fname)
    {
        SPIFFS.begin ();
        File fp = SPIFFS.open(show_fname, "r");

        if (fp)
        {
            char  b[2];
            int   ch;

            b[1] = '\0';

            http_send (show_fname);
            http_send_FS (":<BR><pre>\r\n");

            while ((ch = fp.read ()) >= 0)
            {
                if (ch == '\r')
                {
                    http_send_FS ("&lt;CR&gt;");
                }
                else if (ch == '\n')
                {
                    http_send_FS ("&lt;LF&gt;\n");
                }
                else
                {
                    b[0] = ch;
                    http_send (b);
                }
            }

            fp.close ();
            http_send_FS ("</pre>\r\n");
        }
        SPIFFS.end ();
    }
    end_box ();
    http_trailer ();
    http_flush ();
    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * HTTP update
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_update (void)
{
    const char *        thispage = "update";
    const char *        update_header_cols[UPDATE_HEADER_COLS]               = { "Name", "Value" };
    char *              action;
    char                flash_stm32_filename[MAX_UPDATE_FILENAME_LEN];
    char                stm32_default_filename[MAX_UPDATE_FILENAME_LEN];
    int                 do_update = 0;
    int                 do_reset = 0;
    STR_VAR *           sv;
    char *              version;
    char *              update_host;
    char *              update_path;
    uint_fast16_t       hardware_configuration;
    char                flashsizebuf[32];
    uint32_t            flashsize;
    uint_fast8_t        rtc = 0;

    flash_stm32_filename[0] = '\0';

    sv              = get_strvar (VERSION_STR_VAR);
    version         = sv->str;

    hardware_configuration = get_numvar (HARDWARE_CONFIGURATION_NUM_VAR);

    flashsize = ESP.getFlashChipRealSize ();
    sprintf (flashsizebuf, "%d", flashsize);

    action = http_get_param ("action");

    if (action)
    {
        if (! strcmp (action, "update"))
        {
            do_update = 1;
        }
        else if (! strcmp (action, "saveuphost"))
        {
            set_strvar (UPDATE_HOST_VAR, http_get_param ("uphost"));
        }
        else if (! strcmp (action, "saveuppath"))
        {
            set_strvar (UPDATE_PATH_VAR, http_get_param ("uppath"));
        }
        else if (! strcmp (action, "flash"))
        {
            strncpy (flash_stm32_filename, http_get_param ("stm32_filenames"), 63);
            flash_stm32_filename[63] = '\0';
        }
        else if (! strcmp (action, "reset"))
        {
            do_reset = 1;
        }
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        set_strvar (UPDATE_HOST_VAR, DEFAULT_UPDATE_HOST);
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        set_strvar (UPDATE_PATH_VAR, DEFAULT_UPDATE_PATH);
    }

    if (do_update)
    {
        http_header ("WordClock Update", "40", "/update");
    }
    else if (do_reset)
    {
        http_header ("WordClock Update", "20", "/");
    }
    else
    {
        http_header ("WordClock Update", (const char *) NULL, (const char *) NULL);
    }

    begin_box ("WordClock Update");

    if (flashsize >= 4194304)
    {
        if (flash_stm32_filename[0])
        {
            int i;

            for (i = 0; i < 100; i++)
            {                                                   // send 1000 spaces to force Browser to begin rendering
                http_send ("          "); 
            }

            http_send_FS ("\r\n<P><B>Updating STM32 firmware...<BR>\r\n");
            http_flush ();

            Serial.print ("Flash STM32: http://");
            Serial.print (update_host);
            Serial.print ("/");
            Serial.print (update_path);
            Serial.print ("/");
            Serial.println (flash_stm32_filename);

            delay (200);
            stm32_flash_from_server (update_host, update_path, flash_stm32_filename);
            delay (200);
            Serial.println ("End of flashmode\r\n");
            Serial.flush ();

            http_send_FS ("Done. <font color=red>Please Reset your STM32 now!</font></B><BR>\r\n"
                          "<form method=\"GET\" action=\"/update\">\r\n"
                          "<button type=\"submit\" name=\"action\" value=\"reset\">Reset STM32</button>"
                          "</form>"
                          "<P>\r\n");
            end_box ();
            http_trailer ();
            http_flush ();
        }
        else if (do_reset)
        {
            http_send_FS ("<P><B>Resetting STM32, reconnecting in 20 seconds ...</B><BR>\r\n");
            end_box ();
            http_trailer ();
            http_flush ();
            delay (200);
            stm32_reset ();
        }
        else
        {
            if (do_update)
            {
                char url[MAX_UPDATE_HOST_LEN + MAX_UPDATE_PATH_LEN + MAX_UPDATE_FILENAME_LEN + 3];
    
