ukw100/wordclock24h/ESP8266/ESP-WordClock/http.cpp
                    http_header("WordClock Local Update", NULL, NULL);
                    begin_box ("WordClock Local Update");

                    for (i = 0; i < 100; i++)
                    {                                                   // send 1000 spaces to force Browser to begin rendering
                        http_send ("          "); 
                    }
    
                    stm32_flash_from_local();
                    SPIFFS.remove("stm32.hex");
                    http_send_FS ("Done. <font color=red>Please Reset your STM32 now!</font></B><BR>\r\n");
                    reset_button ();
                }
                else
                {
                    http_header("WordClock Local Update", NULL, NULL);
                    begin_box ("WordClock Local Update");
                    http_send_FS ("<font color='red'>cannot open stm32.hex on SPIFFS for writing.</font><br/>");
                }
    
                SPIFFS.end();
            }
            end_box ();
            http_trailer ();
            http_flush ();
            return 0;
        }
        else if (do_reset)
        {
            http_header ("WordClock Local Update", "20", "/");
            http_send ("<P><B>Resetting STM32, reconnecting in 20 seconds ...</B><BR>\r\n");
            end_box ();
            http_trailer ();
            http_flush ();
            delay (200);
            stm32_reset ();
            return 0;
        }

        http_header("WordClock Local Update", NULL, NULL);
        begin_box ("WordClock Local Update");

        http_send_FS (
                "<br/>Please select the STM32 firmware file<br/>"
                "<form method='post' action='flash_stm32_local' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<input type='file' name='fileField'><br /><br />"
                "<input type='submit' name='submit' value='Update STM32'>"
                "</form>"
                );
        reset_button ();
    }
    else
    {
        http_header("WordClock Local Update", NULL, NULL);
        begin_box ("WordClock Local Update");
        http_send_FS ("<font color=red><B>Flash size of ESP8266 is too small for Local Update over OTA</B></font><BR>\r\n");
    }

    end_box ();
    http_trailer();
    http_flush ();
    return 0;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * http server
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
uint_fast8_t
http (const char * path, const char * const_param)
{
    char param[256];

    strncpy (param, const_param, 255);
    param[255] = '\0';

    char *          p;
    char *          s;
    char *          t;
    int             rtc = 0;

    // log_printf ("http path: '%s'\r\n", path);

    for (p = param; *p; p++)
    {
        if (*p == '+')                                     // plus must be mapped to space if GET method
        {
            *p = ' ';
        }
    }

    // log_printf ("http parameters: '%s'\r\n", param);

    if (param[0])
    {
        http_set_params (param);
    }
    else
    {
        http_set_params ((char *) NULL);
    }

    if (! strcmp (path, "/"))
    {
        rtc = http_main ();
    }
    else if (! strcmp (path, "/network"))
    {
        rtc = http_network ();
    }
    else if (! strcmp (path, "/temperature"))
    {
        rtc = http_temperature ();
    }
    else if (! strcmp (path, "/weather"))
    {
        rtc = http_weather ();
    }
    else if (! strcmp (path, "/ldr"))
    {
        rtc = http_ldr ();
    }
    else if (! strcmp (path, "/dispbright"))
    {
        rtc = http_display_brightness ();
    }
    else if (! strcmp (path, "/ambibright"))
    {
        rtc = http_ambilight_brightness ();
    }
    else if (! strcmp (path, "/display"))
    {
        rtc = http_display ();
    }
    else if (! strcmp (path, "/animations"))
    {
        rtc = http_animations ();
    }
    else if (! strcmp (path, "/overlays"))
    {
        rtc = http_overlays ();
    }
    else if (! strcmp (path, "/ambilight"))
    {
        rtc = http_ambilight ();
    }
    else if (! strcmp (path, "/timers"))
    {
        rtc = http_timers (0);
    }
    else if (! strcmp (path, "/atimers"))
    {
        rtc = http_timers (1);
    }
    else if (! strcmp (path, "/dfplayer"))
    {
        rtc = http_dfplayer ();
    }
    else if (! strcmp (path, "/spiffs"))
    {
        rtc = http_spiffs ();
    }
    else if (! strcmp (path, "/update"))
    {
        rtc = http_update ();
    }
    else if (! strcmp (path, "/flash_stm32_local"))
    {
        rtc = flash_stm32_local ();
    }
    else if (! strcmp (path, "/get_settings"))
    {
        rtc = http_get_settings ();
    }
    else
    {
        const char * p = "HTTP/1.0 404 Not Found";
        http_send (p);
        http_send_FS ("\r\n\r\n404 Not Found\r\n");
        http_flush ();
    }

    return rtc;
}

void
http_post(const String& sPath)
{
    if (sPath == "/flash_stm32_local")
    {
        flash_stm32_local (true);
    }
    else if (sPath == "/spiffs-icon")
    {
        http_spiffs (POST_ICON_FILE);
    }
    else if (sPath == "/spiffs-icon-weather")
    {
        http_spiffs (POST_ICON_WEATHER_FILE);
    }
    else if (sPath == "/spiffs-tables")
    {
        http_spiffs (POST_TABLES_FILE);
    }
}

/*----------------------------------------------------------------------------------------------------------------------------------------
 * http server
 *----------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_server_loop (void)
{
    String  sPath       = "";
    String  sParam      = "";
    String  sCmd        = "";
    String  sGetstart   = "GET ";
    String  sPoststart  = "POST ";
    String  sResponse   = "";
    int     start_position;
    int     end_position_space;
    int     end_position_question;

